import * as Yup from "yup";

const signUpSchema = Yup.object().shape({
  email: Yup.string()
    .required("لطفا ایمیل خود را وارد کنید.")
    .email("لطفا یک ایمیل معتبر وارد کنید.")
    .min(13, "ایمیل باید حداقل 13 کاراکتر باشد.")
    .max(40, "ایمیل باید حداکثر 40 کاراکتر باشد."),
  
  password: Yup.string()
    .required("لطفا رمزعبور خود را وارد کنید.")
    .matches(
      /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,24}$/,
      "رمزعبور باید بین 8 تا 24 کاراکتر باشد و حداقل شامل یک حرف و یک عدد باشد."
    ),
  
  username: Yup.string()
    .required("لطفا نام کاربری خود را وارد کنید.")
    .matches(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط می‌تواند شامل حروف، اعداد و زیرخط (_) باشد."
    )
    .min(5, "نام کاربری باید حداقل 5 کاراکتر باشد.")
    .max(20, "نام کاربری باید حداکثر 20 کاراکتر باشد.")
});

export default signUpSchema;
